Testing various ij connections and comments in front of selects
org.apache.derby.tools.ij extin/testclientij.sql 
ij> driver 'org.apache.derby.jdbc.ClientDriver';
ij> --Bug 4632  Make the db italian to make sure string selects  are working
connect 'jdbc:derby://localhost:1527/wombat;create=true;territory=it' USER 'dbadmin' PASSWORD 'dbadmin';
ij> connect 'jdbc:derby://localhost:1527/wombat' USER 'dbadmin' PASSWORD 'dbadbmin';
ij(CONNECTION1)> -- this is a comment, a comment in front of a select should not cause an error
select * from sys.systables where 1=0;
TABLEID |TABLENAME |& |SCHEMAID |&
-----
0 rows selected
ij(CONNECTION1)> -- this is a comment, a comment in front of a values clauses should not cause an error
values(1);
1          
-----
1          
1 row selected
ij(CONNECTION1)> -- Try some URL attributes
disconnect all;
ij> connect 'jdbc:derby://localhost:1527/junk;create=true' USER 'dbadmin' PASSWORD 'dbadbmin';
ij> select * from APP.notthere;
ERROR 42X05: Table 'APP.NOTTHERE' does not exist.
ij> -- examples from the docs
connect 'jdbc:derby://localhost:1527/wombat;create=true;user=judy;password=judy';
ij(CONNECTION1)> connect 'jdbc:derby://localhost:1527/./wombat;user=judy;password=judy';
ij(CONNECTION2)> connect 'jdbc:derby://localhost:1527/toursDB';
ERROR 08004: The application server rejected establishment of the connection.  An attempt was made to access a database, toursDB, which was not found.
ij(CONNECTION2)> connect 'jdbc:derby://localhost:1527/toursDB' USER 'dbadmin' PASSWORD 'dbadbmin';
ERROR 08004: The application server rejected establishment of the connection.  An attempt was made to access a database, toursDB, which was not found.
ij(CONNECTION2)> connect 'jdbc:derby://localhost:1527/wombat' USER 'APP' PASSWORD 'APP';
ij(CONNECTION3)> connect  'jdbc:derby://localhost:1527/my-db-name;create=true;user=usr;password=pwd';
ij(CONNECTION4)> connect 'jdbc:derby://localhost:1527/my-db-name;upgrade=true;user=usr;password=pwd';
ij(CONNECTION5)> connect 'jdbc:derby://localhost:1527/my-db-name;shutdown=true;user=usr;password=pwd';
ERROR 08006: DERBY SQL error: SQLCODE: -1, SQLSTATE: 08006, SQLERRMC: Database 'my-db-name' shutdown.
ij(CONNECTION5)> connect 'jdbc:derby://localhost:1527/./my-dbname;create=true;user=usr;password=pwd';
ij(CONNECTION6)> connect 'jdbc:derby://localhost:1527/./my-dbname;create=true;user=usr;password=pwd';
ij(CONNECTION7)> connect 'jdbc:derby://localhost:1527/toursDB' USER 'dbadmin' PASSWORD 'dbadbmin';
ERROR 08004: The application server rejected establishment of the connection.  An attempt was made to access a database, toursDB, which was not found.
ij(CONNECTION7)> connect 'jdbc:derby://localhost:1527/wombat' USER 'APP' PASSWORD 'APP';
ij(CONNECTION8)> connect  'jdbc:derby://localhost:1527/my-db-name;create=true;user=usr;password=pwd';
ij(CONNECTION9)> connect 'jdbc:derby://localhost:1527/my-db-name;upgrade=true;user=usr;password=pwd';
ij(CONNECTION10)> connect 'jdbc:derby://localhost:1527/my-db-name;shutdown=true;user=usr;password=pwd';
ERROR 08006: DERBY SQL error: SQLCODE: -1, SQLSTATE: 08006, SQLERRMC: Database 'my-db-name' shutdown.
ij(CONNECTION10)> -- Database names with /'s
connect 'jdbc:derby://localhost:1527/./my-dbname;create=true;user=usr;password=pwd';
ij(CONNECTION11)> connect 'jdbc:derby://localhost:1527/./my-dbname;create=true;user=usr;password=pwd';
ij(CONNECTION12)> -- retrieveMessageText Testing
connect 'jdbc:derby://localhost:1527/my-db-name;create=true;user=usr;password=pwd;retrieveMessageText=false';
ij(CONNECTION13)> -- Should not get message text
select * from APP.notthere;
ERROR 42X05: DERBY SQL error: SQLCODE: -1, SQLSTATE: 42X05, SQLERRMC: APP.NOTTHERE42X05
ij(CONNECTION13)> connect 'jdbc:derby://localhost:1527/my-db-name;create=true;user=usr;password=pwd;retrieveMessageText=true';
ij(CONNECTION14)> -- Should see message text
select * from APP.notthere;
ERROR 42X05: Table 'APP.NOTTHERE' does not exist.
ij(CONNECTION14)> -- just user security mechanism
connect 'jdbc:derby://localhost:1527/my-db-name;create=true;user=usr;retrieveMessageText=true';
ij(CONNECTION15)> connect 'jdbc:derby://localhost:1527/wombat' USER 'APP';
ij(CONNECTION16)> 
