ij> -- note: weird is spelled wrong here.  So you too don't spend 15 minutes figuring that out.
values SUBSTR(SYSCS_UTIL.SYSCS_GET_DATABASE_PROPERTY('logDevice'), LOCATE('wierdlog',SYSCS_UTIL.SYSCS_GET_DATABASE_PROPERTY('logDevice')),8);
1       
--------
wierdlog
ij> call SYSCS_UTIL.SYSCS_SET_DATABASE_PROPERTY('logDevice', null);
ERROR XSRS8: Log Device can only be set during database creation time, it cannot be changed on the fly.
ij> call SYSCS_UTIL.SYSCS_SET_DATABASE_PROPERTY('logDevice', 'foobar');
ERROR XSRS8: Log Device can only be set during database creation time, it cannot be changed on the fly.
ij> values SUBSTR(SYSCS_UTIL.SYSCS_GET_DATABASE_PROPERTY('logDevice'), LOCATE('wierdlog',SYSCS_UTIL.SYSCS_GET_DATABASE_PROPERTY('logDevice')),8);
1       
--------
wierdlog
ij> call SYSCS_UTIL.SYSCS_BACKUP_DATABASE('ext/mybackup');
0 rows inserted/updated/deleted
ij> disconnect;
ij> connect 'wombat;shutdown=true';
ERROR 08006: Database 'wombat' shutdown.
ij> connect 'wombat';
ij> call SYSCS_UTIL.SYSCS_SET_DATABASE_PROPERTY('logDevice', 'foobar');
ERROR XSRS8: Log Device can only be set during database creation time, it cannot be changed on the fly.
ij> values SUBSTR(SYSCS_UTIL.SYSCS_GET_DATABASE_PROPERTY('logDevice'), LOCATE('wierdlog',SYSCS_UTIL.SYSCS_GET_DATABASE_PROPERTY('logDevice')),8);
1       
--------
wierdlog
ij> 
